# Data Cleaning

#### Note: This is not the final notebook. To view to my full analysis, pleasego to the analysis.ipynb notebook.

In this notebook, I will be merging and cleaning four datasets from two websites, IMDB and TMDB. These files can be found in the zippedData folder in the repository.

File names:
- imdb.title.basics.csv.gz
- imdb.title.ratings.csv.gz
- tmdb.movies.csv.gz
- tn.movie_budgets.csv.gz

In [1]:
# importing the necessary pandas and matplotlib libraries
import pandas as pd
import numpy as np

In [2]:
# loading imdb.title.basics dataset & setting it to the variable 'imdb'
imdb = pd.read_csv('zippedData/imdb.title.basics.csv.gz')

# loading imdb.title.ratings dataset & setting it to the variable 'imdb_ratings'
imdb_ratings = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')

# loading tmdb.movies dataset & setting it to the variable 'movie_db'
movie_db = pd.read_csv('zippedData/tmdb.movies.csv.gz')

# loading tn.movie_budgets dataset & setting it to the variable 'movie_budgets'
movie_budgets = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

### file #1: imdb (imdb.title.basics)

In [3]:
# viewing first 5 rows of imdb.title.basics
imdb.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [4]:
# checking how many rows & columns are in imdb.title.basics
imdb.shape

(146144, 6)

In [5]:
imdb.info()

&lt;class &#39;pandas.core.frame.DataFrame&#39;&gt;
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

### file #2: imdb_ratings (imdb.title.ratings)

In [6]:
# viewing first 5 rows of imdb.title.ratings
imdb_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [7]:
# checking how many rows & columns are in imdb.title.ratings
imdb_ratings.shape

(73856, 3)

In [8]:
imdb_ratings.info()

&lt;class &#39;pandas.core.frame.DataFrame&#39;&gt;
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

### file #3: movie_db (tmdb.movies)

In [9]:
# viewing first 5 rows of tmdb.movies
movie_db.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [10]:
movie_db.shape

(26517, 10)

In [11]:
movie_db.info()

&lt;class &#39;pandas.core.frame.DataFrame&#39;&gt;
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

### file #4: movie_budgets (tn.movie_budgets)

In [12]:
# viewing first 5 rows of tn.movie_budgets
movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [13]:
movie_budgets.shape

(5782, 6)

In [14]:
movie_budgets.info()

&lt;class &#39;pandas.core.frame.DataFrame&#39;&gt;
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

## Merging DataFrames

### Merging imdb with imdb_ratings

In [15]:
# Using a Left Join to combine on the tconst column, and setting that to full_imdb
full_imdb = pd.merge(imdb,imdb_ratings, how='left', on='tconst')

In [16]:
# checking that they merged successfully
full_imdb.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

In [17]:
full_imdb.shape

(146144, 8)

In [18]:
full_imdb.info()

&lt;class &#39;pandas.core.frame.DataFrame&#39;&gt;
Int64Index: 146144 entries, 0 to 146143
Data columns (total 8 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
 6   averagerating    73856 non-null   float64
 7   numvotes         73856 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 10.0+ MB

### Merging movie_db and movie_budgets

In [19]:
# Checking to see which columns that both movie_db and movie_budgets have in common
movie_db.loc[movie_db['original_title'] == 'Avatar']

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
6,6,"[28, 12, 14, 878]",19995,en,Avatar,26.526,2009-12-18,Avatar,7.4,18676

In [20]:
movie_budgets.loc[movie_budgets['movie'] == 'Avatar']

   id  release_date   movie production_budget domestic_gross worldwide_gross
0   1  Dec 18, 2009  Avatar      $425,000,000   $760,507,625  $2,776,345,279

In [21]:
# Renaming movie_budgets 'movie' column to 'title' to match movie_db, so that wE can merge them
movie_budgets = movie_budgets.rename(columns={'movie': 'title'})

In [22]:
# checking to see if that worked
movie_budgets.head()

,id,release_date,title,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [23]:
# merging movie_db and movie_budgets on the title column
full_db = pd.merge(movie_db,movie_budgets, how='left', on='title')

In [24]:
# checking that they merged successfully
full_db.head()

,Unnamed: 0,genre_ids,id_x,original_language,original_title,popularity,release_date_x,title,vote_average,vote_count,id_y,release_date_y,production_budget,domestic_gross,worldwide_gross
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,NaN,NaN,NaN,NaN,NaN
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,30.0,"Mar 26, 2010","$165,000,000","$217,581,232","$494,870,992"
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,15.0,"May 7, 2010","$170,000,000","$312,433,331","$621,156,389"
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174,37.0,"Nov 22, 1995","$30,000,000","$191,796,233","$364,545,516"
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,38.0,"Jul 16, 2010","$160,000,000","$292,576,195","$835,524,642"

In [25]:
# checking size of full_db
full_db.shape

(26606, 15)

### Renaming column names for full_imdb and full_db before merging
Here, I am renmaing any column that repeats across both full_imdb and full_db. I just added 'imdb' or 'db' in front of the existing column name. This is so we can preserve the data from each column, and distingush where it came from later.

In [26]:
# renaming columns in full_imdb
full_imdb = full_imdb.rename(columns={'tconst': 'imdb_tconst'})
full_imdb = full_imdb.rename(columns={'original_title': 'imdb_orig_title'})
full_imdb = full_imdb.rename(columns={'averagerating': 'imdb_avg_rating'})
full_imdb = full_imdb.rename(columns={'numvotes': 'imdb_numvotes'})

# renaming columsn in full_db
full_db = full_db.rename(columns={'genre_ids': 'db_genre_ids'})
full_db = full_db.rename(columns={'id_x': 'db_id_x'})
full_db = full_db.rename(columns={'original_title': 'db_orig_title'})
full_db = full_db.rename(columns={'popularity': 'db_popularity'})
full_db = full_db.rename(columns={'id_x': 'db_id_x'})
# renaming title to primary_title because this is the column i will use to join both DataFrames later
full_db = full_db.rename(columns={'title': 'primary_title'})
full_db = full_db.rename(columns={'vote_average': 'db_vote_avg'})
full_db = full_db.rename(columns={'vote_count': 'db_vote_count'})
full_db = full_db.rename(columns={'id_y': 'db_id_y'})

In [27]:
# Checking that full_imdb columns were renamed successfully
full_imdb.head()

,imdb_tconst,primary_title,imdb_orig_title,start_year,runtime_minutes,genres,imdb_avg_rating,imdb_numvotes
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0

In [28]:
# Checking that full_db columns were renamed successfully
full_db.head()

,Unnamed: 0,db_genre_ids,db_id_x,original_language,db_orig_title,db_popularity,release_date_x,primary_title,db_vote_avg,db_vote_count,db_id_y,release_date_y,production_budget,domestic_gross,worldwide_gross
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,NaN,NaN,NaN,NaN,NaN
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,30.0,"Mar 26, 2010","$165,000,000","$217,581,232","$494,870,992"
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,15.0,"May 7, 2010","$170,000,000","$312,433,331","$621,156,389"
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174,37.0,"Nov 22, 1995","$30,000,000","$191,796,233","$364,545,516"
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,38.0,"Jul 16, 2010","$160,000,000","$292,576,195","$835,524,642"

### Dropping 'unnamed: 0' column from full_db

In [29]:
# Confirming that 'unnamed: 0' is just indexing rows
full_db.iloc[344]

Unnamed: 0                                        336
db_genre_ids         [12, 14, 16, 28, 53, 878, 10751]
db_id_x                                         50337
original_language                                  en
db_orig_title                            Firebreather
db_popularity                                   6.591
release_date_x                             2010-11-24
primary_title                            Firebreather
db_vote_avg                                       6.2
db_vote_count                                      33
db_id_y                                           NaN
release_date_y                                    NaN
production_budget                                 NaN
domestic_gross                                    NaN
worldwide_gross                                   NaN
Name: 344, dtype: object

In [30]:
# Since 'unnamed: 0' was only present in tmdb.movies, it isn't consistent for indexing the merged full_db. So i'm going to drop it.
full_db = full_db.drop('Unnamed: 0', axis=1)

In [31]:
# Confirming that the drop worked
full_db.head()

,db_genre_ids,db_id_x,original_language,db_orig_title,db_popularity,release_date_x,primary_title,db_vote_avg,db_vote_count,db_id_y,release_date_y,production_budget,domestic_gross,worldwide_gross
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788,NaN,NaN,NaN,NaN,NaN
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610,30.0,"Mar 26, 2010","$165,000,000","$217,581,232","$494,870,992"
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368,15.0,"May 7, 2010","$170,000,000","$312,433,331","$621,156,389"
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174,37.0,"Nov 22, 1995","$30,000,000","$191,796,233","$364,545,516"
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186,38.0,"Jul 16, 2010","$160,000,000","$292,576,195","$835,524,642"

## Combining the DataFrames full_imdb and full_db

In [32]:
# Merging them with Inner Join, so we only get 'primary_title's that appear on both datasets
all_movies = full_imdb.merge(full_db, on='primary_title', how='inner')

In [33]:
# Checking that it worked
all_movies.head()

,imdb_tconst,primary_title,imdb_orig_title,start_year,runtime_minutes,genres,imdb_avg_rating,imdb_numvotes,db_genre_ids,db_id_x,...,db_orig_title,db_popularity,release_date_x,db_vote_avg,db_vote_count,db_id_y,release_date_y,production_budget,domestic_gross,worldwide_gross
0,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0,"[35, 18]",299782,...,The Other Side of the Wind,9.800,2018-11-02,7.0,64,NaN,NaN,NaN,NaN,NaN
1,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller",4.1,32.0,"[27, 878, 12]",117856,...,Bigfoot,2.813,2012-06-30,2.9,26,NaN,NaN,NaN,NaN,NaN
2,tt4503112,Bigfoot,Bigfoot,2018,NaN,"Action,Horror",4.6,9.0,"[27, 878, 12]",117856,...,Bigfoot,2.813,2012-06-30,2.9,26,NaN,NaN,NaN,NaN,NaN
3,tt9181914,Bigfoot,Bigfoot,2018,86.0,"Animation,Family",2.5,55.0,"[27, 878, 12]",117856,...,Bigfoot,2.813,2012-06-30,2.9,26,NaN,NaN,NaN,NaN,NaN
4,tt0192528,Heaven & Hell,Reverse Heaven,2018,104.0,Drama,4.0,72.0,[18],567662,...,Heaven & Hell,0.600,2018-11-06,7.5,2,NaN,NaN,NaN,NaN,NaN

In [34]:
# Checking amount of rows and columns
all_movies.shape

(24204, 21)

## Data Cleaning for all_movies

In [35]:
# checking for nan values
all_movies.isna().sum()

imdb_tconst              0
primary_title            0
imdb_orig_title          5
start_year               0
runtime_minutes       1935
genres                 356
imdb_avg_rating       3974
imdb_numvotes         3974
db_genre_ids             0
db_id_x                  0
original_language        0
db_orig_title            0
db_popularity            0
release_date_x           0
db_vote_avg              0
db_vote_count            0
db_id_y              19654
release_date_y       19654
production_budget    19654
domestic_gross       19654
worldwide_gross      19654
dtype: int64

In [36]:
# Dropping rows that have a repeating 'primary_title' value. This makes sure that there's only one entry per movie
all_movies = all_movies.drop_duplicates(subset='primary_title', keep='first', inplace=False)

In [37]:
# Keeping missing data and replacing NaN with a string

# This categorical data can't really be "filled in" so it's better to just replace the missing values with a string, so I won't have to drop the rows.
all_movies.fillna({'genres':'missing', 'imdb_orig_title':'missing'}, inplace=True)

# These columns are important for my analysis and I don't want to drop such a large amount of data. But replacing the data with a median would skew everything too much. It's better to work with the smaller sample data that's here.
# So I replaced them with np.nan
all_movies.fillna({'production_budget': np.nan, 'domestic_gross': np.nan,'worldwide_gross': np.nan}, inplace=True)

In [38]:
# converting to all currency values to float

# removing symbols from production_budget
all_movies['production_budget'] = all_movies['production_budget'].str.replace(',', '')
all_movies['production_budget'] = all_movies['production_budget'].str.replace('$', '')
# converting values in production_budget to float
all_movies['production_budget'] = all_movies['production_budget'].apply(lambda x: float(x))

# removing symbols from worldwide_gross
all_movies['worldwide_gross'] = all_movies['worldwide_gross'].str.replace(',', '')
all_movies['worldwide_gross'] = all_movies['worldwide_gross'].str.replace('$', '')
# converting values in worldwide_gross to float
all_movies['worldwide_gross'] = all_movies['worldwide_gross'].apply(lambda x: float(x))

# removing symbols from domestic_gross
all_movies['domestic_gross'] = all_movies['domestic_gross'].str.replace(',', '')
all_movies['domestic_gross'] = all_movies['domestic_gross'].str.replace('$', '')
# converting values in domestic_gross to float
all_movies['domestic_gross'] = all_movies['domestic_gross'].apply(lambda x: float(x))

In [39]:
# Replacing numerical values with the column's median
# We do this because filling in NaN values with the column median will have the least impact on the data
all_movies.fillna({'runtime_minutes': (all_movies['runtime_minutes'].median()),
'imdb_avg_rating': (all_movies['imdb_avg_rating'].median()), 
'imdb_numvotes': (all_movies['imdb_numvotes'].median())}, inplace=True)

In [40]:
# Dropping columns that have no impact on the DataFrame because I'm not using it in the analysis
all_movies.drop('db_id_y', axis=1, inplace=True)
all_movies.drop('release_date_y', axis=1, inplace=True)

## Saving cleaned dataset as CSV

In [41]:
# save cleaned dataset as CSV
all_movies.to_csv('./all_movies_df.csv')